app/Filament/Widgets/ExhibitionPieChartWidget.php

    protected function getData(): array
    {
        $data = Record::query()
            ->select('associations.name as exhibition_name', DB::raw('COUNT(*) as count'))
            ->join('associations', 'records.exhibition_id', '=', 'associations.id')
            ->whereNotNull('records.exhibition_id')
            ->where('associations.type', 'exhibition')
            ->groupBy('associations.name')
            ->pluck('count', 'exhibition_name')
            ->toArray();
---
select `associations`.`name` as `exhibition_name`, COUNT(*) as count from `records` inner join `associations` on `records`.`exhibition_id` = `associations`.`id` where `records`.`exhibition_id` is not null and `associations`.`type` = 'exhibition' group by `associations`.`name`