app/Filament/Widgets/ResourceBarChartWidget.php

select `associations`.`name` as `resource_name`, COUNT(*) as count from `records` inner join `associations` on `records`.`resource_id` = `associations`.`id` where `records`.`resource_id` is not null and `associations`.`type` = 'resource' group by `associations`.`name`
---
    protected function getData(): array
    {
        $data = Record::query()
            ->select('associations.name as resource_name', DB::raw('COUNT(*) as count'))
            ->join('associations', 'records.resource_id', '=', 'associations.id')
            ->whereNotNull('records.resource_id')
            ->where('associations.type', 'resource')
            ->groupBy('associations.name')
            ->pluck('count', 'resource_name')
            ->toArray();