app/Filament/Widgets/SectorBarChartWidget.php

select `associations`.`name` as `sector_name`, COUNT(*) as count from `records` inner join `associations` on `records`.`sector_id` = `associations`.`id` where `records`.`sector_id` is not null and `associations`.`type` = 'sector' group by `associations`.`name`
---
    protected function getData(): array
    {
        $data = Record::query()
            ->select('associations.name as sector_name', DB::raw('COUNT(*) as count'))
            ->join('associations', 'records.sector_id', '=', 'associations.id')
            ->whereNotNull('records.sector_id')
            ->where('associations.type', 'sector')
            ->groupBy('associations.name')
            ->pluck('count', 'sector_name')
            ->toArray();