app/Filament/Resources/RecordResource.php

            ])
            ->selectCurrentPageOnly()
            ->paginated([5, 10, 25, 50, 100])
            ->bulkActions([
                Tables\Actions\BulkActionGroup::make([
//                    SendBulkEmailAction::make(),
//                    SendBulkSmsAction::make(),
                    DeleteBulkAction::make(),
                ]),
                BulkAction::make('deleteAll')
                    ->label(fn($livewire) => __('Delete All ' . $livewire->getFilteredTableQuery()->count() . ' Records'))
                    ->color('danger')
                    ->icon('heroicon-o-trash')
                    ->deselectRecordsAfterCompletion()
                    ->requiresConfirmation()
                    ->action(function ($livewire) {
                        if (method_exists($livewire, 'getFilteredTableQuery')) {
                            $filteredQuery = $livewire->getFilteredTableQuery();
                            $filteredQuery->delete();
                        } else {
                            Record::query()->delete();
                        }
                    })
            ])
            ->deferLoading()
            ->striped();
---
select count(*) as aggregate from `records` where (`email` like '%573404299%')
select count(*) as aggregate from `records`

                                    'type' => 'exhibition',
                                ])->id),

                            Select::make('resource_id')
                                ->relationship('resource', 'name')
                                ->searchable()
                                ->preload()
                                ->options(function ($get) {
                                    $exhibitionId = $get('exhibition_id');
                                    if (!$exhibitionId) return [];
                                    return Record::query()
                                        ->where('exhibition_id', $exhibitionId)
                                        ->select('resource_id')
                                        ->distinct()
                                        ->with('resource')
                                        ->get()
                                        ->mapWithKeys(function ($record) {
                                            return [$record->resource_id => optional($record->resource)->name];
                                        })
                                        ->filter()
                                        ->toArray();
                                })
                                ->label(__('form.resource'))
                                ->createOptionForm([
                                    TextInput::make('name')->label(__('form.name'))->maxLength(255),
                                    TextInput::make('other_info')->label(__('form.other_info'))->maxLength(255),
                                    TextInput::make('type')->hidden()->default('resource'),
                                ])
---
select count(*) as aggregate from `records`