app/Filament/Resources/RecordResource.php

                                        return collect();
                                    }

                                    return State::query()
                                        ->where('country_id', $countryId)
                                        ->pluck('name', 'id');
---
select `name`, `id` from `states` where `country_id` = '191'